package Honja2;

/* 변수의 사용 범위

- 자바의 모든 변수는 중괄호{} 블록 내에서 선언되고 사용됨.
- 메소드 내에서 선언된 변수 = 로컬 변수 > 메소드 블록 내부에서만 사용되고 메소드 실행 긑나면 메모리에서 자동 삭제
- 변수는 자신이 속한 블록 내부에서만 사용 가능

변수 선언시 주의 사항
1. 변수가 어떤 범위에서 사용될 것인지 생각하고, 선언 위치 결정
2. 메소드 불록 전체에서 사용하고 시다면 메소드 블록 첫머리에 선언
3. 특정 블록 내부에서만 사용된다면 해당 블록 내에 선언
 */

// 변수의 사용 범위
public class VariableScopeExample {
    public static void main(String[] args) {
        int v1 = 15;
        if(v1 > 10) {
            int v2;
            v2 = v1 - 10;
        }
//        int v3 = v1 + v2 + 5;    // v2 변수 사용 할 수 없어서 컴파일 에러
    }
}
